In [131]:
import datetime
import os
import meteostat
import pandas as pd
import psycopg2 as pg
from psycopg2.extras import execute_values

In [60]:
stadiums = pd.read_csv("stadiums.csv")
stadiums.head()

,venue,team,abbrev,lat,long
0,Chase Field,Arizona Diamondbacks,AZ,33.445278,-112.066944
1,Turner Field,Atlanta Braves,ATL,33.735278,-84.389444
2,Oriole Park at Camden Yards,Baltimore Orioles,BAL,39.283889,-76.621667
3,Fenway Park,Boston Red Sox,BOS,42.346389,-71.097500
4,Wrigley Field,Chicago Cubs,CHC,41.948333,-87.655556

In [42]:
conn = pg.connect(
    dbname="mlb",
    user="postgres",
    password=os.environ.get("MLB_DB_PASSWORD"),
    host="database-1.cqhpcblctccg.us-east-1.rds.amazonaws.com",
)
cur = conn.cursor()

In [51]:
query = "SELECT team_id, abbrev FROM team;"
cur.execute(query)
teams = pd.DataFrame(cur.fetchall(), columns=[c[0] for c in cur.description])
teams.head()

   team_id abbrev
0        7    OAK
1        8    LAD
2        9     SD
3       25     SF
4       27    SEA

In [58]:
assert set(teams["abbrev"]) == set(stadiums["Abbreviation"])

In [63]:
df = teams.merge(stadiums)[["team_id", "lat", "long"]].set_index("team_id")
df.head()

               lat        long
team_id
7        37.751667 -122.200556
8        34.073611 -118.240000
9        32.707300 -117.156600
25       37.778333 -122.389444
27       47.591389 -122.332500

In [114]:
stations = meteostat.Stations()
station_ids = {}

for team_id in df.index:
    team_stations = stations.nearby(df["lat"][team_id], df["long"][team_id]).fetch(10)

    for station_idx in team_stations.index:
        if team_stations["hourly_start"][station_idx] < datetime(
            2008, 1, 1
        ) and team_stations["hourly_end"][station_idx] > datetime(2024, 1, 1):
            station_ids[team_id] = station_idx
            break

assert set(teams["team_id"]) == station_ids.keys()

In [119]:
df["nearest_station_id"] = df.index.map(station_ids)
df.head()

               lat        long nearest_station_id
team_id
7        37.751667 -122.200556              72493
8        34.073611 -118.240000              KCQT0
9        32.707300 -117.156600              72290
25       37.778333 -122.389444              72493
27       47.591389 -122.332500              KBFI0

In [128]:
query = "SELECT game_id, game_date, home_team_id FROM game;"
cur.execute(query)
game_info = pd.DataFrame(cur.fetchall(), columns=[c[0] for c in cur.description])
game_info.head()

   game_id   game_date  home_team_id
0   257754  2009-04-03            16
1   257751  2009-04-03             8
2   706921  2022-04-05             8
3   332491  2012-03-29             9
4   332498  2012-03-29            19

In [130]:
game_data = game_info.merge(df, left_on="home_team_id", right_on=df.index).set_index(
    "game_id"
)
game_data.head()

          game_date  home_team_id        lat        long nearest_station_id
game_id
257754   2009-04-03            16  39.905833  -75.166389              72408
257751   2009-04-03             8  34.073611 -118.240000              KCQT0
706921   2022-04-05             8  34.073611 -118.240000              KCQT0
332491   2012-03-29             9  32.707300 -117.156600              72290
332498   2012-03-29            19  32.751389  -97.082778              KGPM0

In [175]:
# get weather for each game
values = []

for game_id in game_data.index:
    start = datetime.datetime.strptime(
        f"{game_data['game_date'][game_id].strftime('%Y-%m-%d')} 00:00",
        "%Y-%m-%d %H:%M",
    )
    end = start + datetime.timedelta(hours=12)
    data = meteostat.Hourly(
        game_data["nearest_station_id"][game_id], start, end
    ).fetch()
    values.append((game_id,) + tuple(data.iloc[0].values))

In [176]:
# create DataFrame of weather for each game
data_cols = [
    "game_id",
    "temp",
    "dwpt",
    "rhum",
    "prcp",
    "snow",
    "wdir",
    "wspd",
    "wpgt",
    "pres",
    "tsun",
    "coco",
]
game_weather = pd.DataFrame(values, columns=data_cols)
game_weather.head()

,game_id,temp,dwpt,rhum,prcp,snow,wdir,wspd,wpgt,pres,tsun,coco
0,257754,15.6,12.2,80.0,0.0,NaN,130.0,9.4,NaN,1012.3,NaN,NaN

In [ ]:
# TO DO: Get game times to get accurate hourly weather
# TO DO: Get stadium orientation to get accurate wind